In [38]:
import sqlite3
# Create a connection to a database file (or use ':memory:' for temporary DB)
conn = sqlite3.connect('weather_data.db') # This creates weather_data.db in your folder
cursor = conn.cursor()
print("Connected to:", conn.execute("PRAGMA database_list").fetchall())

Connected to: [(0, 'main', 'J:\\Asad-Learning\\Python-Learning\\weather_data.db')]

In [34]:
cursor.execute("ALTER TABLE weather RENAME TO employee")
conn.commit()

OperationalError: no such table: weather

In [29]:
cursor.execute("SELECT name FROM sqlite_master WHERE type='table'")
print(cursor.fetchall())

[('sqlite_sequence',), ('employee',)]

cursor.execute("PRAGMA table_info(employee)")
print(cursor.fetchall())

In [26]:
cursor.execute("SELECT sql FROM sqlite_master WHERE type='table' AND name='employee'")
print(cursor.fetchone())

('CREATE TABLE "employee" (\n"Name" TEXT,\n  "Age" INTEGER,\n  "City" TEXT,\n  "Salary" INTEGER\n)',)

In [31]:
cursor.execute('''
    INSERT INTO employee(name, Age, City, Salary)
    VALUES(?,?,?,?)
''',('Muhammad', 28, 'NY', 70000))
conn.commit()

In [35]:
import pandas as pd 

df = pd.read_sql_query('SELECT * FROM employee', conn)
df

        Name  Age         City  Salary
0      David   34    San Diego   79076
1    Charlie   35      Phoenix   76699
2      Quinn   38     New York   93478
3        Eve   32      Phoenix   92233
4       Paul   27      Houston   96396
5     Hannah   58     New York   59351
6       Nate   29  San Antonio   60027
7      Grace   47    San Diego   83846
8       Nate   59      Houston   84534
9      Quinn   59  San Antonio   83279
10     Grace   39  San Antonio   79001
11       Ian   43  San Antonio   65220
12       Bob   44    San Diego   48379
13    Hannah   56     New York   84126
14      Paul   35      Houston   91438
15      Liam   32      Chicago  118931
16    Hannah   36  Los Angeles   80513
17      Nate   29  San Antonio   89020
18    Olivia   49  San Antonio   87224
19     Steve   38     New York   94769
20  Muhammad   28           NY   70000

In [36]:
conn.close()

✅ Project: Import CSV into SQLite & Query It


Step 1: Load CSV with Pandas

In [37]:
import pandas as pd 

df = pd.read_csv("data.csv")

df.head()

      Name  Age       City  Salary
0    David   34  San Diego   79076
1  Charlie   35    Phoenix   76699
2    Quinn   38   New York   93478
3      Eve   32    Phoenix   92233
4     Paul   27    Houston   96396

step 2 load csvfile into database 

Step 2: Create SQLite DB & Table 


if_exists='replace': recreates the table every time

index=False: avoids saving DataFrame index as a DB column


import sqlite3 

conn = sqlite3.connect('weather_data.db')
print("Connected to:", conn.execute("PRAGMA database_list").fetchall())

In [59]:
cursor.execute("SELECT name FROM sqlite_master WHERE type='table'")
print(cursor.fetchall())

[('sqlite_sequence',), ('employee',)]

In [46]:

# Store CSV data into a table named "employee"
df.to_sql('employee', conn, if_exists='replace', index=False)

20

🪜 Step 3: Run SQL Queries with Pandas

In [52]:
query='SELECT * FROM employee'

result_df = pd.read_sql_query(query, conn)
result_df.head()

      Name  Age       City  Salary
0    David   34  San Diego   79076
1  Charlie   35    Phoenix   76699
2    Quinn   38   New York   93478
3      Eve   32    Phoenix   92233
4     Paul   27    Houston   96396

In [64]:
tabels = pd.read_sql_query("SELECT name FROM sqlite_master WHERE type='table'", conn)
tabels

              name
0  sqlite_sequence
1         employee

In [65]:
conn.close()

In [68]:
from sqlalchemy import create_engine
# SQLite connection (file-based)
engine = create_engine("sqlite:///products.db")

In [73]:
from sqlalchemy.orm import declarative_base
from sqlalchemy import Integer, String, Float, ForeignKey
from sqlalchemy.orm import relationship


Base = declarative_base() 

class Product(Base):
    __tablename__ = 'products'
    id = Column(Integer, primary_key=True)
    name = Column(String)
    price = Column(Float)
    sales = relationship("Sale", back_populates="product")

    

class Sale(Base):
    __tablename__ = 'sales'
    id = Column(Integer, primary_key=True)
    product_id = Column(Integer, ForeignKey('products.id'))
    quantity = Column(Integer)
    product = relationship("Product", back_populates="sales")

NameError: name 'Column' is not defined